
// 正八格和禄刃格为普通格局

export type GeType = '正官格' | '七杀格' | '正财格' | '偏财格' | '正印格' | '偏印格' | '食神格' | '伤官格' | '正官格' | '七杀格' | '正财格' | '偏财格' | '正印格' | '偏印格' | '食神格' | '伤官格'
| '建禄格' | '阳刃格' | '曲直格' | '炎上格' | '稼穑格' | '从革格' | '润下格'
| '从财格' | '从官格' | '从煞格' | '从儿格' | '财官食伤均势格'
| '从火气格' | '从木气格' | '从土气格' | '从金气格' | '从水气格'
| '化土格' | '化木格' | '化金格' | '化水格' | '化火格'
| '土魁罡格' | '庚辰金魁罡格' | '庚戌金魁罡格' | '水魁罡格'
| '金神格'

export const Ge = {
  ZhengBaGe: {
    '正官格': '正官格',
    '七杀格': '七杀格',
    '正财格': '正财格',
    '偏财格': '偏财格',
    '正印格': '正印格',
    '偏印格': '偏印格',
    '食神格': '食神格',
    '伤官格': '伤官格'
  },
  LuRenGe: {
    '建禄格': '建禄格',
    '阳刃格': '阳刃格'
  },
  ZhuanWangGe: {
    '曲直格': '曲直格',
    '炎上格': '炎上格',
    '稼穑格': '稼穑格',
    '从革格': '从革格',
    '润下格': '润下格'
  },
  CongGe: {
    CongShiGe: {
      '从财格': '从财格',
      '从官格': '从官格',
      '从煞格': '从煞格',
      '从儿格': '从儿格',
      '财官食伤均势格': '财官食伤均势格'
    },
    CongQiGe: {
      '从火气格': '从火气格',
      '从木气格': '从木气格',
      '从土气格': '从土气格',
      '从金气格': '从金气格',
      '从水气格': '从水气格'
    },
    HuaGe: {
      '化土格': '化土格',
      '化木格': '化木格',
      '化金格': '化金格',
      '化水格': '化水格',
      '化火格': '化火格'
    }
  }
}



